{
    "summary_analysis": {
        "username": "kojied",
        "total_posts": 15,
        "total_comments": 15,
        "most_active_period": "Late Night (9pm-4am UTC)",
        "average_post_score": 18.87,
        "average_comment_score": 3.47,
        "nsfw_post_percentage": 0.0,
        "spoiler_post_percentage": 6.67,
        "original_content_percentage": 0.0,
        "edited_comment_percentage": 6.67
    },
    "content_for_llm": [
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/newyorkcity/comments/1lykkqf/i_feel_violated_by_intern_season/",
            "content": "Post Title: I feel violated by intern season\n\nPost Body: There's this bar that I frequent a few blocks away from my house. Technically different neighborhood, but generally has a mature vibe with people who like music and to dance. Today when I went to the bar and all of a sudden I felt like I was at a college basement party. I thought that I must have been hallucinating, but Then a girl pointed at me and referred to me as the old person. That's when I knew I had to get out of there.\n I was at the wrong party. \n\nAs I walk back home, all of a sudden I realize that there were now tens of thousands of 18 year-old 19 year-old 20-year-olds who were all living on top of each other and were super young and horny to basically use the New York nightlife as their own personal orgy dome.\n Naturally I felt violated\n\nBut then again, I thought to myself. Am I not the same as they are, just at a longer time horizon? I'm also a transient being in the city. They might only be here for three months, but I've only been here for three years as well. As a matter fact, there are bunch of people have done this for generations where their parents and their grandparents and their grandparents all met in New York, and they all decided to live somewhere in the broader region whether it be Westchester, Wilmington, Big Indian, Boston, etc. \nNew York City is equally adventurous to each, so who am I to judge how others enjoy this adventurous city."
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/AskReddit/comments/1hnx8j0/h1b_holders_what_are_your_thoughts_on_the/",
            "content": "Post Title: H1B holders, what are your thoughts on the narrative that you are being exploited?\n\nPost Body:"
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/AskReddit/comments/1hnx7lj/h1b_holders_do_you_feel_exploited_or_see_it_as_an/",
            "content": "Post Title: H1B holders, do you feel exploited, or see it as an opportunity to build a better life for you in the US?\n\nPost Body:"
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/nba/comments/1hcopxo/what_needs_to_happen_for_the_league_to_review_the/",
            "content": "Post Title: What needs to happen for the league to review the inconsistencies of the refs?\n\nPost Body: [removed]"
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/Conservative/comments/1h8ddbp/are_you_guys_foragainst_banning_tiktok_in_the_us/",
            "content": "Post Title: Are you guys for/against banning Tiktok in the US?\n\nPost Body: [removed]"
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/GenZ/comments/1erotgn/whats_a_movie_that_best_represents_your_childhood/",
            "content": "Post Title: What’s a movie that best represents your childhood?\n\nPost Body: There's so many coming of age movies for boomers and millennials, what about for gen-Z?"
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/VisionPro/comments/1b4yi15/spacial_tours_with_3d_map_and_360_video/",
            "content": "Post Title: Spacial tours with 3D map and 360˚ video\n\nPost Body:"
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/visionosdev/comments/1b3yugb/best_blogs_tutorial_channels_to_learn/",
            "content": "Post Title: Best blogs, tutorial channels to learn\n\nPost Body: Hey I’m an iOS developer building in visionOS. Do people have recommendations on resources to catch up on new featuresets for spacial computing?"
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/VisionPro/comments/1b36n83/cant_wait_for_vision_air_5_launching_in_2034_with/",
            "content": "Post Title: Can't wait for Vision Air 5 launching in 2034 with these transparent displays!\n\nPost Body:"
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/VisionPro/comments/1alx270/watching_edgerunners_on_the_moon_feels/",
            "content": "Post Title: Watching Edgerunners on the moon feels\n\nPost Body: Thank you u/overpaidengineer for the inspo"
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/VisionPro/comments/1alf7av/killer_feature_accessing_chatgpt_ipad_app_and/",
            "content": "Post Title: Killer feature: accessing chatGPT (iPad app) and using audio as primary input\n\nPost Body: I just find this to be much easier than doing it on my Mac + display setup. Give it a try"
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/VisionPro/comments/1ajbkqm/would_you_guys_like_to_see_pokemon_go_in_avp/",
            "content": "Post Title: Would you guys like to see Pokemon Go in AVP?\n\nPost Body: Hi guys,\n\nI think Pokemon could be one of the killer use case for the vision pro. Imagine, you could fight players from around the world from the comfort of your couch. With the recent controversy around Palworld, they're looking for the next \"Pokemon Go\" that would propel their franchise to the next level.\n\nBeing Japanese, I happen to know a few key decision makers both in the Pokemon Company as well as Niantic. Alot of the in-game designs are transferrable, and I believe it's a matter of time until Niantic's Lightship ARDK will work on AVP.\n\n*What should I tell them? Lmk if you have thoughts or useful links/videos I should forward to them.*\n\nI'm confident that this will eventually become a thing, but the faster they ship the more AVP adoption we'll see.\n\n[personal info redacted for obvious reasons](https://preview.redd.it/be7qbqfg5qgc1.png?width=800&format=png&auto=webp&s=21fec81575a29fa53fc01639e368980dc4c5ac6f)"
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/VisionPro/comments/1aiwqa2/can_you_actually_work_in_avp/",
            "content": "Post Title: Can you actually “work” in AVP?\n\nPost Body: I’m curious if people have been able to fully port their workflow into AVP.\n\nI’ve been trying to actually use the Vision Pro to get some work done, but without github and visual studio code, it’s not been the easiest (also obviously no terminal). I could use Mac virtual display, but since I have a M1 MBP the latency is noticeable to the point it’s an adverse experience. I already dropped $4k on this device, renewing my MBP just so I can use it with my AVP is asking a bit too much…\n\nAlso where’s Xcode? If Apple wants AVP to be a “work device”, they gotta have at least Xcode right?\n\nI can get the simple stuff like emails done through AVP, but if this device can’t replace my entire workflow, I don’t know if I can justify the price. I’m sure it’ll get resolved down the line (more of a software issue than hardware constraints), but curious to hear how realistic it is for people to port over their workflow to AVP, and what apps you’d like to see ASAP."
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/OnePiece/comments/18o4k0u/theory_what_if_we_live_in_the_void_800_century/",
            "content": "Post Title: 【Theory】 What if we live in the void 800 century\n\nPost Body: Let’s say the WG is the current western civilization. \n\nThe birth of Western history is in the Middle East, specifically Iraq (Nippur). Which is why the west, led by the US, has been trying to cause instability, and destroy historical artifacts. That way, the true history of how the WG came to be won’t come into light. Like, archaeology is basically using artifacts discovered and interpreting it a certain way. The whole concept is something that mostly grew into a concept in the UK around 1824. 1824 is the year the Oxford English Dictionary defined \"archaeology\" a word.\n\n(Btw our generation will be remembered for our new additions which include anti-work, curry laksa, diet-busting, final frontier, fugazi, gajillion, skellington, straight-talking, stonkingly, voguing,etc.)\n\nBack to the main topic, what I’m saying is that it’s pretty easy for the “1%” to control the “story of our world” through archeologists and historians. These have traditionally been an activity for the rich and remains that way. Like, who tries to become a historian unless they have trust funds?\n\nSo yeah, maybe the history we are told on a daily basis is pretty different from reality, and Oda is trying to tell us this message.\n\nWhat are pacifistas? They're our modern comparable to AI. They will be the ultimate, infinite, obedient, power between the celestial dragons (also known as the 1%) and us normal humans.\n\nSo who is our Nika? Who is our Joy Boy? are we too early to hear the drums of liberation, or do we actually all have our own drums of liberation?\n\n&#x200B;\n\n&#x200B;\n\n[tourism of 19th century](https://preview.redd.it/bt1oqgxker7c1.png?width=400&format=png&auto=webp&s=2530f2a3b52b37bfd7547cfe4cf61b5d9d52e7c7)"
        },
        {
            "type": "Post",
            "source_url": "https://www.reddit.com/r/plantclinic/comments/16tj525/helpenglish_ivy_is_withering_any_suggestions_on/",
            "content": "Post Title: 【Help!】English ivy is withering, any suggestions on what I should do?\n\nPost Body:"
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/ManorLords/comments/1ly3nuf/my_granary_burned_down/n2r16t2/",
            "content": "Sorry to hear that man, in the future you may want to have multiple granaries, one close to your berries/deer/fish and one for your veggies/apples/honey.\nAlso I just store ale at the tavern or keep it in the brewery for this reason"
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/ManorLords/comments/1lwfdh8/anyone_else_having_an_issue_where_their_trading/n2dn0vm/",
            "content": "Yeah but it doesn’t seem to affect much though"
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/ChatGPT/comments/1lvtwj3/i_used_ai_to_create_this_short_film_on_human/n2b07h0/",
            "content": "Incredible stuff! How did you maintain character consistency? Did you generate a consistent character image and then use the image-to-video feature?"
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/ManorLords/comments/1lse9cn/great_game_i_hope_there_is_something_new_added_in/n1i5k2p/",
            "content": "I do too but I rarely finish a game haha. Too little late game content"
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/ManorLords/comments/1lse9cn/great_game_i_hope_there_is_something_new_added_in/n1i52vu/",
            "content": "I do too but I rarely finish a game haha. Too little late game content"
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/ManorLords/comments/1lscpmo/how_does_influence_on_hard_work/n1hhd7z/",
            "content": "You have to kill the bandit units, or donate crop yields though the manor (tithing, different from taxation)."
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/ManorLords/comments/1lq4lst/this_is_acceptable/n1089i9/",
            "content": "That proximity is ridiculous, deep mining, two fishing huts, vegetable, orchards, and trade iron for malt.\nimo trading raw materials is easier than trading crafted goods in the current build. High quantity stuff is easy to stock, and you could have multiple trading posts up without any major issues.\nThe exact opposite of this is plate armor. It takes forever to build, requires three points, and needs eight iron slabs to make it. It’s cheaper to just export the ore, and since it’s a low quantity trade, it’s hard to stick multiple trade posts with it"
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/ManorLords/comments/1ljgy2w/confession/mzopv8i/",
            "content": "Yeah I was doing alright and then as soon as I upgraded to tier 3 my town was in shambles. I didn’t notice how demanding it was going to be"
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/ManorLords/comments/1lihry5/am_i_doing_something_wrong_with_food_management_i/mzc2uit/",
            "content": "So in general each family will eat each type of food equally. Which means those with low supply are more likely to be consumed first.\n\nEggs I believe each plot only produces one per month, so it's helpful, but won't be sufficient to maintain food diversity"
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/ManorLords/comments/1lg0qii/the_ability_to_combine_regions_or_make_aivassal/myulv47/",
            "content": "I build my cities close to the borders of others, that way I'm not managing multiple cities at once. The best is building it at the three-way border. That way you're basically managing three cities at once."
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/FoodNYC/comments/1lc0fio/if_you_had_to_spend_one_full_day_eating_your_way/mxxhvpf/",
            "content": "Breakfast - Buvette\n\nCoffee - Lyria\n\nLunch - Tsukemen okiboru\n\nCoffee - La cabra\n\nDinner - Isodi\n\nDrinks - Double chicken please"
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/NFT/comments/1l2gcmt/nfts_in_2025_where_are_we_headed/mvt4t5c/",
            "content": "\\- the hype has definitely faded, you can see that with the price as well as the number of people discussing it on X, or even here  \n\\- haven't seen much innovation in the space at all, the momentum seems to have shifted to solana memecoins, and dissipated after that  \n\\- again, people no longer seem interested. I found linksDAO to be an interesting concept of fractionally owning a golf course, and they're still active but not much hype around them anymore either. Most major brand NFT collaborations have died down as well  \n\\- the NFT craze has not settled into something sustainable, it's dead. Can it come back? Possibly, it has happened before, when cryptopunks and cryptokitties were first hot in 2017-ish, then died, then came back during 2020-2022.  \n\\- will there be a big boom? I personally don't think it would in the way we think of NFTs as collectables. A major thesis was around digital scarcity, and that seemed possible during covid, but post covid people went back to f2f interactions. Digital scarcity could become a hot topic again if we see a broader adoption of VR or even XR, but that seems a bit down the line. I think fractional ownership of assets could be interesting, but they'd just be fungible tokens, not NFT\n\nI see so many one-off posts on this community with only a couple responses. Can't believe there's 2.7M members here. That alone should tell you that NFTs are no longer something people are interested in. I'd love to be proven wrong, since I feel that there was alot of potential, but so far it seems like the community is dead"
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/AskReddit/comments/1kz5a0n/do_you_think_millennials_generally_look_younger/mv2xf3q/",
            "content": "Millenials have less kids, so they have more time and money to spend on themselves. Millenials are also getting married less and later in life, meaning we allocate more effort on self care"
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/AskReddit/comments/1ksghx5/what_happened_on_the_first_date_that_made_you/mtnzw3v/",
            "content": "I wore a toga. she showed up in regular clothes"
        },
        {
            "type": "Comment",
            "source_url": "https://www.reddit.com/r/nycrail/comments/1kplupt/anyone_want_this_subway_token_wallet/mt02ziy/",
            "content": "Sent dm!"
        }
    ]
}